In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'], 'key2' : ['one', 'two', 'one', 'two', 'one'], 'data1' : np.random.randn(5), 'data2' : np.random.randn(5)})

In [5]:
df

  key1 key2     data1     data2
0    a  one -0.312762 -0.993661
1    a  two  0.840831  0.430124
2    b  one -0.016709  0.858685
3    b  two -1.573372 -0.066019
4    a  one -0.249916  0.919810

In [6]:
grouped = df['data1'].groupby(df['key1'])

In [8]:
grouped.mean()

key1
a    0.092717
b   -0.795041
Name: data1, dtype: float64

In [9]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [10]:
means

key1  key2
a     one    -0.281339
      two     0.840831
b     one    -0.016709
      two    -1.573372
Name: data1, dtype: float64

In [11]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [12]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [13]:
df['data1'].groupby([states, years]).mean()

California  2005    0.840831
            2006   -0.016709
Ohio        2005   -0.943067
            2006   -0.249916
Name: data1, dtype: float64

In [14]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [17]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.312762 -0.993661
1    a  two  0.840831  0.430124
4    a  one -0.249916  0.919810
b
  key1 key2     data1     data2
2    b  one -0.016709  0.858685
3    b  two -1.573372 -0.066019

In [19]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -0.312762 -0.993661
4    a  one -0.249916  0.919810
('a', 'two')
  key1 key2     data1     data2
1    a  two  0.840831  0.430124
('b', 'one')
  key1 key2     data1     data2
2    b  one -0.016709  0.858685
('b', 'two')
  key1 key2     data1     data2
3    b  two -1.573372 -0.066019

In [20]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [21]:
grouped = df.groupby(df.dtypes, axis=1)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_10056\521057107.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  grouped = df.groupby(df.dtypes, axis=1)

In [22]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.312762 -0.993661
1  0.840831  0.430124
2 -0.016709  0.858685
3 -1.573372 -0.066019
4 -0.249916  0.919810
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [23]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [24]:
s_grouped.mean()

key1  key2
a     one    -0.036925
      two     0.430124
b     one     0.858685
      two    -0.066019
Name: data2, dtype: float64

In [25]:
people = pd.DataFrame(np.random.randn(5, 5), columns=['a', 'b', 'c', 'd', 'e'], index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [26]:
people.iloc[2:3, [1, 2]] = np.nan

In [27]:
people

               a         b         c         d         e
Joe    -0.172195  0.044937  0.231428  0.685378 -0.508144
Steve   1.538834  0.070612 -0.744397  1.429165  0.235838
Wes     0.401669       NaN       NaN -0.253241  1.553586
Jim    -1.899954 -0.134243  0.636100  0.280155  0.688587
Travis -0.035094 -0.877536 -0.191406 -0.375459 -2.209549

In [28]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [29]:
by_column = people.groupby(mapping, axis=1)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_10056\3111365124.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  by_column = people.groupby(mapping, axis=1)

In [30]:
by_column.sum()

            blue       red
Joe     0.916806 -0.635402
Steve   0.684768  1.845283
Wes    -0.253241  1.955255
Jim     0.916255 -1.345610
Travis -0.566865 -3.122179

In [31]:
map_series = pd.Series(mapping)

In [32]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [33]:
people.groupby(map_series, axis=1).count()

C:\Users\lenovo\AppData\Local\Temp\ipykernel_10056\1833935060.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [34]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'], [1, 3, 5, 1, 3]], names=['cty', 'tenor'])

In [35]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [36]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.163488 -0.819816  1.339644  1.381749 -0.045833
1      0.090086  1.283680 -0.805582 -0.145638  0.167734
2     -0.933898  0.022497 -0.256498 -2.066897 -0.116579
3     -1.764628 -0.884016 -0.060583 -1.611845 -0.226042

In [37]:
hier_df.groupby(level='cty', axis=1).count()

C:\Users\lenovo\AppData\Local\Temp\ipykernel_10056\2333815484.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [38]:
df

  key1 key2     data1     data2
0    a  one -0.312762 -0.993661
1    a  two  0.840831  0.430124
2    b  one -0.016709  0.858685
3    b  two -1.573372 -0.066019
4    a  one -0.249916  0.919810

In [39]:
grouped = df.groupby('key1')

In [40]:
grouped['data1'].quantile(0.9)

key1
a    0.622681
b   -0.172376
Name: data1, dtype: float64

In [41]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.092717  0.648646 -0.312762 -0.281339 -0.249916  0.295457
b      2.0 -0.795041  1.100727 -1.573372 -1.184207 -0.795041 -0.405875

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.840831   3.0  0.118758  0.994009 -0.993661 -0.281768  0.430124
b    -0.016709   2.0  0.396333  0.653864 -0.066019  0.165157  0.396333


           75%       max
key1
a     0.674967  0.919810
b     0.627509  0.858685

In [42]:
tips = pd.read_csv("C:/Users/lenovo/Downloads/tips.csv")

In [43]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [44]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [45]:
grouped = tips.groupby(['day', 'smoker'])

In [46]:
grouped_pct = grouped['tip_pct']

In [47]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [49]:
grouped_pct.agg(['mean', 'std'])

                 mean       std
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [50]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

C:\Users\lenovo\AppData\Local\Temp\ipykernel_10056\345979284.py:1: FutureWarning: The provided callable <function std at 0x000001822A7CCF40> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [51]:
functions = ['count', 'mean', 'max']

In [55]:
result = grouped[['tip_pct', 'total_bill']].agg(functions)

In [56]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [57]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [58]:
grouped.agg({'tip' : np.max, 'size' : 'sum'})

C:\Users\lenovo\AppData\Local\Temp\ipykernel_10056\683326323.py:1: FutureWarning: The provided callable <function max at 0x000001822A7CC400> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  grouped.agg({'tip' : np.max, 'size' : 'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [59]:
grouped.agg({'tip_pct' : ['min', 'max', 'mean', 'std'], 'size' : 'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

In [60]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [61]:
top(tips, n=6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [62]:
tips.groupby('smoker').apply(top)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_10056\1695234324.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [63]:
tips.groupby('smoker', group_keys=False).apply(top)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_10056\1502793219.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  tips.groupby('smoker', group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
88        24.71  5.85     No  Thur   Lunch     2  0.236746
185       20.69  5.00     No   Sun  Dinner     5  0.241663
51        10.29  2.60     No   Sun  Dinner     2  0.252672
149        7.51  2.00     No  Thur   Lunch     2  0.266312
232       11.61  3.39     No   Sat  Dinner     2  0.291990
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [64]:
frame = pd.DataFrame({'data1': np.random.randn(1000), 'data2': np.random.randn(1000)})

In [65]:
quartiles = pd.cut(frame.data1, 4)

In [66]:
quartiles [:10]

0      (-0.0153, 1.54]
1      (-0.0153, 1.54]
2    (-1.571, -0.0153]
3    (-1.571, -0.0153]
4    (-1.571, -0.0153]
5      (-0.0153, 1.54]
6      (-0.0153, 1.54]
7      (-0.0153, 1.54]
8    (-1.571, -0.0153]
9      (-0.0153, 1.54]
Name: data1, dtype: category
Categories (4, interval[float64, right]): [(-3.132, -1.571] < (-1.571, -0.0153] < (-0.0153, 1.54] < (1.54, 3.095]]

In [67]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(), 'count': group.count(), 'mean': group.mean()}

In [68]:
grouped = frame.data2.groupby(quartiles)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_10056\3611942682.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  grouped = frame.data2.groupby(quartiles)

In [69]:
grouped.apply(get_stats).unstack()

                        min       max  count      mean
data1
(-3.132, -1.571]  -2.125465  2.612283   63.0 -0.003022
(-1.571, -0.0153] -2.988419  2.888147  436.0  0.179420
(-0.0153, 1.54]   -3.353952  2.634962  441.0 -0.026594
(1.54, 3.095]     -2.883230  2.242946   60.0 -0.067060

In [70]:
grouping = pd.qcut(frame.data1, 10, labels=False)

In [71]:
grouped = frame.data2.groupby(grouping)

In [72]:
grouped.apply(get_stats).unstack()

            min       max  count      mean
data1
0     -2.125465  2.612283  100.0  0.093200
1     -2.149142  2.836927  100.0  0.070577
2     -2.201232  2.888147  100.0  0.164811
3     -2.988419  2.785461  100.0  0.210063
4     -1.934262  2.436220  100.0  0.232337
5     -2.987176  1.989122  100.0 -0.024593
6     -2.238100  2.634962  100.0  0.081838
7     -2.668767  1.798935  100.0 -0.235802
8     -3.353952  2.549066  100.0  0.049092
9     -2.883230  2.571377  100.0 -0.018672

In [73]:
s = pd.Series(np.random.randn(6))

In [74]:
s[::2] = np.nan

In [75]:
s

0         NaN
1   -1.918205
2         NaN
3    1.339133
4         NaN
5   -1.095638
dtype: float64

In [76]:
s.fillna(s.mean())

0   -0.558237
1   -1.918205
2   -0.558237
3    1.339133
4   -0.558237
5   -1.095638
dtype: float64

In [77]:
states = ['Ohio', 'New York', 'Vermont', 'Florida', 'Oregon', 'Nevada', 'California', 'Idaho']

In [78]:
group_key = ['East'] * 4 + ['West'] * 4

In [79]:
data = pd.Series(np.random.randn(8), index=states)

In [80]:
data

Ohio          0.560808
New York     -2.739471
Vermont       0.911915
Florida      -0.319309
Oregon       -0.949220
Nevada       -1.327524
California   -0.674802
Idaho         0.597084
dtype: float64

In [81]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan

In [82]:
data

Ohio          0.560808
New York     -2.739471
Vermont            NaN
Florida      -0.319309
Oregon       -0.949220
Nevada             NaN
California   -0.674802
Idaho              NaN
dtype: float64

In [83]:
data.groupby(group_key).mean()

East   -0.832658
West   -0.812011
dtype: float64

In [84]:
fill_mean = lambda g: g.fillna(g.mean())

In [85]:
data.groupby(group_key).apply(fill_mean)

East  Ohio          0.560808
      New York     -2.739471
      Vermont      -0.832658
      Florida      -0.319309
West  Oregon       -0.949220
      Nevada       -0.812011
      California   -0.674802
      Idaho        -0.812011
dtype: float64

In [86]:
fill_values = {'East': 0.5, 'West': -1}

In [87]:
fill_func = lambda g: g.fillna(fill_values[g.name])

In [88]:
data.groupby(group_key).apply(fill_func)

East  Ohio          0.560808
      New York     -2.739471
      Vermont       0.500000
      Florida      -0.319309
West  Oregon       -0.949220
      Nevada       -1.000000
      California   -0.674802
      Idaho        -1.000000
dtype: float64

In [89]:
suits = ['H', 'S', 'C', 'D']

In [90]:
card_val = (list(range(1, 11)) + [10] * 3) * 4

In [91]:
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']

In [92]:
cards = []
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names)

In [93]:
deck = pd.Series(card_val, index=cards)

In [94]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [95]:
def draw(deck, n=5):
    return deck.sample(n)

In [96]:
draw(deck)

6S    6
8C    8
7H    7
5S    5
4H    4
dtype: int64

In [97]:
get_suit = lambda card: card[-1]

In [98]:
deck.groupby(get_suit).apply(draw, n=2)

C  AC      1
   10C    10
D  JD     10
   6D      6
H  10H    10
   5H      5
S  9S      9
   7S      7
dtype: int64

In [101]:
tips = pd.read_csv("C:/Users/lenovo/Downloads/tips.csv")

In [106]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [107]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'], columns='smoker')

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863

In [108]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'], columns='smoker', margins=True)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
time   day
Dinner Fri   2.000000  2.222222  2.166667  0.139622  0.165347  0.158916
       Sat   2.555556  2.476190  2.517241  0.158048  0.147906  0.153152
       Sun   2.929825  2.578947  2.842105  0.160113  0.187250  0.166897
       Thur  2.000000       NaN  2.000000  0.159744       NaN  0.159744
Lunch  Fri   3.000000  1.833333  2.000000  0.187735  0.188937  0.188765
       Thur  2.500000  2.352941  2.459016  0.160311  0.163863  0.161301
All          2.668874  2.408602  2.569672  0.159328  0.163196  0.160803

In [109]:
tips.pivot_table('tip_pct', index=['time', 'smoker'], columns='day', aggfunc=len, margins=True)

day             Fri   Sat   Sun  Thur  All
time   smoker
Dinner No       3.0  45.0  57.0   1.0  106
       Yes      9.0  42.0  19.0   NaN   70
Lunch  No       1.0   NaN   NaN  44.0   45
       Yes      6.0   NaN   NaN  17.0   23
All            19.0  87.0  76.0  62.0  244

In [110]:
tips.pivot_table('tip_pct', index=['time', 'size', 'smoker'], columns='day', aggfunc=len, fill_value=0)

day                 Fri  Sat  Sun  Thur
time   size smoker
Dinner 1    No        0    1    0     0
            Yes       0    1    0     0
       2    No        3   25   27     1
            Yes       8   28   12     0
       3    No        0   12   11     0
            Yes       0    6    4     0
       4    No        0    7   16     0
            Yes       1    6    2     0
       5    No        0    0    2     0
            Yes       0    1    1     0
       6    No        0    0    1     0
Lunch  1    No        0    0    0     1
            Yes       1    0    0     0
       2    No        0    0    0    34
            Yes       5    0    0    13
       3    No        1    0    0     2
            Yes       0    0    0     2
       4    No        0    0    0     3
            Yes       0    0    0     2
       5    No        0    0    0     1
       6    No        0    0    0     3